In [3]:
# Please follow each step to complete the programming exercise.
# The information in each parenthesis shows where you can find related content for the command execution.

# Problem A.
# 1.Please use the following line to create frame.
# frame = pd.DataFrame(np.arange(12).reshape((4,3)),
#                     index=[['a','a','b','b'],[1,2,1,2]],
#                      columns = [['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])
# 2.Let’s define frame1 and frame 2 as follows:
# frame1 = frame.stack().stack()
# frame2 = frame.unstack().unstack()
# 3.Apply a series of .swaplevel() and a .sort_index() to frame 2 so that it is the same as frame 1. 
# You don’t need to worry about the data type of the values in the dataframe (Reordering and Sorting Levels in 8.1)

# Problem B.
# 1.Let left and right be as follows:
# left = pd.DataFrame({'id': [1, 2, 3, 4, 5],
#                      'Name1': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
#                      'subject_id': ['sub1', 'sub2', 'sub4', 'sub6', 'sub5']})
# right = pd.DataFrame({'id': [1, 2, 3, 4, 5],
#                       'Name2': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
#                       'subject_id': ['sub2', 'sub4', 'sub3', 'sub5', 'sub6']})
# 2.Let’s merge left and right using outer join on subject_id. Call in df_union.
# 3.Display the rows of df_union, which contain NaN values. 
# (It’s considered as the complement of the intersection of two DataFrames.) (Hint: You can use isnull() and any())

In [2]:
import pandas as pd
import numpy as np

In [20]:
#Problem A
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    index=[['a','a','b','b'],[1,2,1,2]],
                    columns = [['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [21]:
frame1 = frame.stack().stack()
frame2 = frame.unstack().unstack()

In [22]:
frame1

a  1  Green  Colorado     2.0
             Ohio         0.0
      Red    Ohio         1.0
   2  Green  Colorado     5.0
             Ohio         3.0
      Red    Ohio         4.0
b  1  Green  Colorado     8.0
             Ohio         6.0
      Red    Ohio         7.0
   2  Green  Colorado    11.0
             Ohio         9.0
      Red    Ohio        10.0
dtype: float64

In [23]:
frame2

Ohio      Green  1  a     0
                    b     6
                 2  a     3
                    b     9
          Red    1  a     1
                    b     7
                 2  a     4
                    b    10
Colorado  Green  1  a     2
                    b     8
                 2  a     5
                    b    11
dtype: int64

In [49]:
# Apply a series of .swaplevel() and a .sort_index() to frame 2 so that it is the same as frame 1.
frame2.swaplevel(0,3).swaplevel(1,2).sort_index(axis=0)

a  1  Green  Colorado     2
             Ohio         0
      Red    Ohio         1
   2  Green  Colorado     5
             Ohio         3
      Red    Ohio         4
b  1  Green  Colorado     8
             Ohio         6
      Red    Ohio         7
   2  Green  Colorado    11
             Ohio         9
      Red    Ohio        10
dtype: int64

In [50]:
# Problem B.
left = pd.DataFrame({'id': [1, 2, 3, 4, 5],
                      'Name1': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
                      'subject_id': ['sub1', 'sub2', 'sub4', 'sub6', 'sub5']})
right = pd.DataFrame({'id': [1, 2, 3, 4, 5],
                       'Name2': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
                       'subject_id': ['sub2', 'sub4', 'sub3', 'sub5', 'sub6']})

In [51]:
left

   id   Name1 subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5

In [52]:
right

   id  Name2 subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub5
4   5  Betty       sub6

In [55]:
# 2.Let’s merge left and right using outer join on subject_id. Call in df_union.
df_union = pd.merge(left,right, on='subject_id', how= 'outer')

df_union

   id_x   Name1 subject_id  id_y  Name2
0   1.0    Alex       sub1   NaN    NaN
1   2.0     Amy       sub2   1.0  Billy
2   3.0   Allen       sub4   2.0  Brian
3   4.0   Alice       sub6   5.0  Betty
4   5.0  Ayoung       sub5   4.0  Bryce
5   NaN     NaN       sub3   3.0   Bran

In [64]:
# 3.Display the rows of df_union, which contain NaN values. 
# (It’s considered as the complement of the intersection of two DataFrames.) (Hint: You can use isnull() and any())
df_union[df_union.isnull().any(axis=1)]

   id_x Name1 subject_id  id_y Name2
0   1.0  Alex       sub1   NaN   NaN
5   NaN   NaN       sub3   3.0  Bran